In [1]:
import pandas as pd
import os

RAW_PATH = "../data/raw"

files = os.listdir(RAW_PATH)
files

['NH3_STFR.csv',
 'NO23_STFR.csv',
 'OP_STFR.csv',
 'SSC_STFR.csv',
 'TN_STFR.csv',
 'TP_STFR.csv']

In [10]:
df = pd.read_csv("../data/raw/TN_STFR.csv")

df.head()

     dateTime code  value
0  1974-10-11   TN   1.09
1  1974-11-07   TN   0.90
2  1974-12-05   TN   1.20
3  1975-01-09   TN   1.46
4  1975-02-14   TN   1.92

In [11]:
df = pd.read_csv("../data/raw/TN_STFR.csv")

df.head()

     dateTime code  value
0  1974-10-11   TN   1.09
1  1974-11-07   TN   0.90
2  1974-12-05   TN   1.20
3  1975-01-09   TN   1.46
4  1975-02-14   TN   1.92

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 507 entries, 0 to 506
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   dateTime  507 non-null    object
 1   code      507 non-null    object
 2   value     507 non-null    float64
dtypes: float64(1), object(2)
memory usage: 12.0+ KB

In [5]:
df["dateTime"] = pd.to_datetime(df["dateTime"])
df.head()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 507 entries, 0 to 506
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   dateTime  507 non-null    datetime64[ns]
 1   code      507 non-null    object
 2   value     507 non-null    float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 12.0+ KB

In [6]:
df.rename(columns={"value": "TN"}, inplace=True)
df.head()

    dateTime code    TN
0 1974-10-11   TN  1.09
1 1974-11-07   TN  0.90
2 1974-12-05   TN  1.20
3 1975-01-09   TN  1.46
4 1975-02-14   TN  1.92

In [7]:
df.to_csv("../data/processed/TN_processed.csv", index=False)

In [2]:
import pandas as pd
import os

RAW_PATH = "../data/raw"

files = os.listdir(RAW_PATH)
files

['NH3_STFR.csv',
 'NO23_STFR.csv',
 'OP_STFR.csv',
 'SSC_STFR.csv',
 'TN_STFR.csv',
 'TP_STFR.csv']

In [5]:
df = pd.read_csv("../data/raw/TP_STFR.csv")
df["dateTime"] = pd.to_datetime(df["dateTime"])
df.rename(columns={"value":"TP"}, inplace=True)
df.to_csv("../data/processed/TP_processed.csv", index=False)
df.head()

    dateTime code    TP
0 1974-08-16   TP  0.14
1 1974-09-12   TP  0.22
2 1974-10-11   TP  0.08
3 1974-11-07   TP  0.11
4 1975-01-09   TP  0.13

In [6]:
df = pd.read_csv("../data/raw/NH3_STFR.csv")
df["dateTime"] = pd.to_datetime(df["dateTime"])
df.rename(columns={"value":"NH3"}, inplace=True)
df.to_csv("../data/processed/NH3_processed.csv", index=False)
df.head()

    dateTime code   NH3
0 1969-10-31  NH3  0.23
1 1970-03-18  NH3  0.20
2 1974-10-11  NH3  0.02
3 1974-11-07  NH3  0.02
4 1974-12-05  NH3  0.02

In [19]:
df = pd.read_csv("../data/raw/OP_STFR.csv")
df["dateTime"] = pd.to_datetime(df["dateTime"])
df.rename(columns={"value":"OP"}, inplace=True)
df.to_csv("../data/processed/OP_processed.csv", index=False)
df.head()

    dateTime code        OP
0 1969-10-31   OP  0.228270
1 1969-11-19   OP  0.326100
2 1969-12-22   OP  0.026088
3 1970-01-15   OP  0.130440
4 1970-02-16   OP  0.414147

In [20]:
df = pd.read_csv("../data/raw/SSC_STFR.csv")


df["start_date"] = pd.to_datetime(df["start_date"])


df.rename(columns={
    "start_date": "dateTime",
    "value": "SSC"
}, inplace=True)



df.rename(columns={"resultVal":"SSC"}, inplace=True)
df.rename(columns={"USGSPCode":"code"}, inplace=True)
df.to_csv("../data/processed/SSC_processed.csv", index=False)

df.head()

    dateTime   code    SSC
0 1978-06-05  80154  247.0
1 1978-07-12  80154  359.0
2 1978-08-15  80154  367.0
3 1978-09-14  80154  159.0
4 1978-10-23  80154  196.0

In [18]:
df = pd.read_csv("../data/raw/NO23_STFR.csv")
df["dateTime"] = pd.to_datetime(df["dateTime"])
df.rename(columns={"value":"NO23"}, inplace=True)
df.to_csv("../data/processed/N023_processed.csv", index=False)
df.head()

    dateTime  code  NO23
0 1967-10-05  NO23  0.52
1 1967-11-22  NO23  0.38
2 1967-12-17  NO23  0.47
3 1968-01-22  NO23  0.38
4 1968-03-04  NO23  0.84

In [12]:
df.columns

Index(['dateTime', 'code', 'OP'], dtype='object')

In [26]:
import pandas as pd

tn = pd.read_csv("../data/processed/TN_processed.csv")
tp = pd.read_csv("../data/processed/TP_processed.csv")
nh3 = pd.read_csv("../data/processed/NH3_processed.csv")
no23 = pd.read_csv("../data/processed/N023_processed.csv")
op = pd.read_csv("../data/processed/OP_processed.csv")
ssc = pd.read_csv("../data/processed/SSC_processed.csv")

dfs = [tn, tp, nh3, no23, op, ssc]
for df in dfs:
    df["dateTime"] = pd.to_datetime(df["dateTime"])

In [30]:
import pandas as pd

def load_csv(path, value_name):
    df = pd.read_csv(path)
    df["dateTime"] = pd.to_datetime(df["dateTime"])
    df.drop(columns=["code"], inplace=True, errors="ignore")   # drop code safely
    df.rename(columns={"value": value_name}, inplace=True)
    return df

tn  = load_csv("../data/processed/TN_processed.csv",  "TN")
tp  = load_csv("../data/processed/TP_processed.csv",  "TP")
nh3 = load_csv("../data/processed/NH3_processed.csv", "NH3")
no23= load_csv("../data/processed/N023_processed.csv","N023")
op  = load_csv("../data/processed/OP_processed.csv",  "OP")
ssc = load_csv("../data/processed/SSC_processed.csv", "SSC")

In [ ]:
final_df = tn.merge(tp, on="dateTime", how="outer")\
             .merge(nh3, on="dateTime", how="outer")\
             .merge(no23, on="dateTime", how="outer")\
             .merge(op, on="dateTime", how="outer")\
             .merge(ssc, on="dateTime", how="outer")

final_df.sort_values("dateTime", inplace=True)
final_df.reset_index(drop=True, inplace=True)

final_df.head()
final_df.info()

    dateTime  TN  TP  NH3  NO23  OP  SSC
0 1967-10-05 NaN NaN  NaN  0.52 NaN  NaN
1 1967-11-22 NaN NaN  NaN  0.38 NaN  NaN
2 1967-12-17 NaN NaN  NaN  0.47 NaN  NaN
3 1968-01-22 NaN NaN  NaN  0.38 NaN  NaN
4 1968-03-04 NaN NaN  NaN  0.84 NaN  NaN

In [ ]:
final_df.fillna(method='ffill', inplace=True)
final_df.dropna(inplace=True)
final_df.info()

C:\Users\sagam\AppData\Local\Temp\ipykernel_20836\1434447439.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  final_df.fillna(method='ffill', inplace=True)

      dateTime    TN    TP   NH3  NO23    OP    SSC
172 1978-06-05  2.51  0.05  0.02   1.8  0.05  247.0
173 1978-07-12  2.13  0.19  0.02   1.3  0.05  359.0
174 1978-08-15  2.47  0.34  0.17   1.5  0.05  367.0
175 1978-09-14  2.40  0.16  0.02   0.6  0.05  159.0
176 1978-10-23  1.98  0.20  0.02   1.3  0.05  196.0

In [36]:
final_df.to_csv("../data/final/master_dataset.csv", index=False)

In [37]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 541 entries, 172 to 712
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   dateTime  541 non-null    datetime64[ns]
 1   TN        541 non-null    float64
 2   TP        541 non-null    float64
 3   NH3       541 non-null    float64
 4   NO23      541 non-null    float64
 5   OP        541 non-null    float64
 6   SSC       541 non-null    float64
dtypes: datetime64[ns](1), float64(6)
memory usage: 33.8 KB